[
  {
    "part1": "In a time well before ours, mythical beasts & creatures occupied our vast lands, seas and our skies. Some of the bravest of men and women started hunting these beasts, holding them captive. Of these beasts the most prized were the Phoenix and the Griffins. Both mighty and powerful. They were held captive, untamed behind the castle walls. Holding these beasts brought riches to their kingdoms. The more one held the more riches were received. Holding more in captivity one would get more respect from other kingdoms. However greed quickly set in and one greedy man who orchestrated the distribution of said riches had been planing a plot all along. From his throne he figured out it was only a matter of time before these wild untamed beasts would no longer survive in their captive state. So when the time was right, he took off with the riches of all the kingdoms. This upset the Kings and Queens of the kingdoms & the hunt for the man was on. Many brave men & women set out on missions to find the man and bring him to justice. They would go on month long treks over land and by sea, discovering many new beasts as they navigate their way through the vast lands. Some of the brave would never be seen nor heard from again others would return with nothing but their stories of horrors and triumphs to tell. With their captured beasts weakening day by day and no longer returning riches. They had no idea what to do.. The beasts were dying slowly, even after being released.. A few weeks later a small but determined group of strangers came forward some from other lands and kingdoms far, far away, They came with stories of  other fierce & mythical beasts not been heard of in our lands. They tell tales of untold fortunes that await beyond our lands. Some carry strange yet powerful weapons and others wear artefacts that have never been seen before. They, together speak of a plan, they held a magic serum that could be given to the beasts which would end their slow painful death. The serum would put the beasts to sleep before turning them into ashes. The strangers had more to tell but decided that was best told another time. Before long the word had got around and all the kingdoms had agreed to trust the strangers and use the serum. As a mark of respect for the beasts the kingdoms folk gathered the ashes and spread them in the burial grounds in front of a tombstone that was made by one of the strangers.. People visited this tombstone and before long stories were going around about an unexplainable strange energy coming from it & everyone that visited would have varying stories, some would soon after visiting come into good fortune & riches, some ridden with wretched diseases and aliments would be cured within days... While others would become instantly ill, some become ill of mind and run outside the castle walls screaming into the darkness never to return again. Some of the town drunks even had claimed to have seen the stone glowing in different colours as well as other strange sightings.  Could it be true ? or maybe its just a bad batch of mead.."
  },
  {
    "part2": "Once learning of the mysterious happenings the strangers returned with concerns of some citizens becoming ill of mind and body after visiting the site. They arrived into town with carts filled with serums,  amulets filled with glowing liquids, relics and artefacts from afar. One introduced himself to the gathering towns folk,  his profession being an Arch-Mage who comes from a long family line of Potioneers and Alchemists. Another dressed in a robe made from the scales of a golden dragon, on his head he wore  the skull of a dragon which had two large solstones in the eye sockets. The gathered townsfolk had never seen anything like it before and the looked at him in awe of his robes. He addressed the crowd and introduced himself he said he was an enchanted sharman who once served for the dragonborn. He had come to speak to the spirits in the now sacred burial grounds. While the rest if the strangers began unloading the carts and setting up camp just outside the castle walls the Arch-Mage and the Sharman headed to the burial grounds with their carts. They spent 6 nights there to observe and document all the mysterious happenings. On the 7th night they decided to awaken one of the spirits and speak to them. The Sharman carefully placed some candles around the grave site where the ashes were spread, he then knelt before it and started speaking in an ancient language.  The Arch-Mage then placed an amulet filled with a liquid that glowed bright like fire on the tombstone. After some time the ground started to tremor and flames arose from the grave site. Suddenly a flame shot high up in the air, it was so bright it lit up the night sky & turned the day to night briefly. All the townsfolk came out of their abodes and they looked up in amazement. The sky eventually turned back to darkness but before everyone returned to their abodes a flaming figure appeared flying around in the night sky. The towns folk looked on in disbelief as they rubbed their eyes to make sure they are seeing right.. The figure looked familiar in the shape of a phoenix but this one looked fierce, it looked angry.  It flew around in the sky squawking before finally landing in the fields opposite the burial grounds letting out a blood curdling scream.. The Arch-Mage and the Sharman unafraid headed to the field to speak to the flaming beast. The beasts were indeed angry, they were gone too soon, they weren't done. They were ready to return, they wanted revenge.. But the sharman explained it wasn't the townsfolk fault, it was the fault of the former ruler and the Keepers of Beasts just wanted to do what they thought was best. This calmed the Flaming Phoenix down and they spoke at length for many hours and just before dawn the Phoenix screamed into the air and flew high up into the sky before diving back into earth with a thunderous bang.. By sun up they made their way back to camp with all their findings and discussed it with the Keepers of Beasts. They devised a plan to once again bring the beasts back to life. They knew they couldn't do this alone, they knew they would need help. With little riches left in the kingdoms they needed help from some of the most determined individuals and the call to arms was put out. A few more days had passed and the call was answered. Some brave men and women from lands far away had gathered at the camp. A meeting took place and together they etched their plans on parchment paper.  They formed groups each with their own set of responsibilities. They would be lead by the Arch-Mage a Grand Master in his own right. Then those deemed worthy were appointed the role of Grand Chancellor's, a role for only the most elite and battle hardened.  One of the men given this role was the Sharman. The other was a battle hardened & head strong strategist, abandoned as a child and bought up by peasants he was taught from an early age that there is no surrender and to win you must defeat and conquer those that stand in the way. He carried a sword made from materials not yet discovered in these parts. It was engraved with hieroglyphics down the blade that glowed green, the handle made from gold resebling a dragon and had 2 green solstones in the eyesockets. His armour was made from hardened metals that only a master blacksmith could make & much like the sword had the same engravings with a green solstone in the middle of the breastplate. The role of Commander was only given to those with connections and those who had the ability to spread the word fast when needed. Knights of Danjon were very unique in their own right and tasked with keeping law and order. With the ranks set and everyone's tasks set they were almost ready, but they would need to join with another kingdom, one from the other world. They would join forces with the Jelly clan. A clan who have much experience in the very epic battle that was about to be entered by the Danjon.  The would partnership would offer an advisory council,  a place to hold the beasts and in return would once again earn kingdoms the once lost income & riches, putting food back on the table. Allowing the kingdoms to once again thrive. With everything in place the Grand Master addressed the townsfolk and the Keepers of Beasts of the plans. This excited many of them and while many of the returned Keepers were excited about the plans, many were out on expeditions exploring other kingdoms unaware of the plans. But alas the Grand Master Arch-Mage had a plan for this too and the news of the resurrection would reach every Keeper of Beasts afar...."
  }
]
